import H3 from '@/components/headings/H3'
import styles from './Page.module.scss'

const page = () => {
	return (
		<div className="space-y-6 max-w-[650px]">
			<H3>Як працює АПІ?</H3>
			<p>
				Наше API працює на основі простої та ефективної концепції, що дозволяє
				користувачам легко і швидко отримувати доступ до необхідних функцій для
				їхнього бізнесу. В цій статті ми розглянемо основні кроки, які потрібно
				виконати для початку використання нашого API.
			</p>
			<ul className={styles.list}>
				<li>
					<div className={styles.list_image}></div>
					<div>
						<h5>Реєстрація облікового запису</h5>
						<p>
							Перший крок - реєстрація облікового запису на нашому веб-сайті.
							Процес реєстрації дуже простий і займає лише кілька хвилин. Після
							успішної реєстрації вам буде надано особистий обліковий запис, де
							ви зможете керувати своїми налаштуваннями та ключами API.
						</p>
					</div>
				</li>
				<li>
					<div className={styles.list_image}></div>
					<div>
						<h5>Створення API ключа та дозвіл хостів</h5>
						<p>
							Після реєстрації ви можете створити свій API ключ та дозволити
							хости, які будуть мати доступ до товарів. API ключ - це унікальний
							ідентифікатор, який використовується для аутентифікації запитів до
							нашого API. Ви можете створити декілька ключів та хостів, якщо це
							потрібно для вашого бізнесу, і керувати ними зі свого облікового
							запису.
						</p>
					</div>
				</li>
				<li>
					<div className={styles.list_image}></div>
					<div>
						<h5>Надсилання запитів до API</h5>
						<p>
							Після отримання API ключа ви готові використовувати наше API. Ви
							можете надсилати HTTP-запити до нашого API, включаючи запити на
							отримання товарів, відправлення замовлень та інші операції. Наш
							API працює як повноцінний сервер, що надає вам доступ до всіх
							необхідних функцій для управління вашим бізнесом.
						</p>
					</div>
				</li>
			</ul>
			<p>
				Таким чином, використання нашого API - це простий і зручний спосіб
				отримати доступ до необхідних функцій для вашого бізнесу. Ми надаємо
				зручні інструменти для керування вашими даними і допомагаємо вам
				розвивати ваш бізнес ефективно і без зайвих зусиль.
			</p>
		</div>
	)
}

export default page
